#-*- coding:utf-8 -*-

### Автоматизированной системы онлайн игры «Виселица» "@viselic_bot".
### Разработчики: Лобанов Иван Алексеевич, Россия, г. Москва, РЭУ им. Г. В. Плеханова, ФМЭСИ; Трофимова Ксения Аркадьевна, Россия, г. Москва, РЭУ им. Г. В. Плеханова, ФМЭСИ.
### Версия 1.0.0

### Токен бота, позволяющий управлять ботом.
token = 

### Алфавит языка, на котором играет пользователь .
alfa=['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я']

### Кодировка смайликов выводимых в игре.
b = "\U0001F3C6"
s = '\U00002764'


### Текстовые константы, служащие для общения АС с Пользователем
c_1 = '\n --------------------------------------------------------------------------------------------------------------------------------------------------------'
c_2 = 'Слово:'
c_3 = 'Жизни:'
c_4 = 'Введенные буквы:'
c_5 = 'Отгаданные буквы:'
c_6 = ';'
conf_2 = "Пользователь вводит смайлики или Буквы верхенего регистра"
comment_1 = 'Приветствую тебя избранный! Если ты готов сыграть нажимай: /start \n'
comment_2 = 'У меня пока нет настроек.\n'
comment_3 = 'Правила игры:\nЦель игры - угадать слово. Я задумываю слово, вы, называя буквы, угадываете его. У вас есть 7 жизней, за одну ошибку вы теряете одну жизнь. Ответом явялется только буква русского алфавита нижнего регистра. Чтобы сыграть нажмите:/start.\n'
comment_4 = 'Меня зовут Viselic. Я создан Лобановым Иваном и Трофимовой Ксенией. Я могу сыграть с вами в стандартную версию игры виселица, для того чтобы сыграть нажмите:/start.\n Чтобы узнать правила нажмите:/regulations.\n'
comment_5 = 'Да начнется игра!!!\n'
comment_6 = 'Вы ввели неправильный символ.\n'
comment_7 = 'Вы повторяете букву.\n'
comment_8 = 'Такой буквы нет в слове.\n'
comment_9 = 'Поздравляем, чтобы сыграть заново нажмите на /start.\n'
comment_10 = 'Вы проиграли, но не расстраивайтесь, получится в следующий раз.\nЧтобы сыграть заново нажмите на /start.\n'
comment_11 = 'Мое слово:'
comment_12 = 'Введите букву:\n'
comment_13 = "Пользователь вводит смайлики или Буквы верхенего регистра"
comment_14 ="Мое слово:\n"
